#Задача 2: Найдите сумму цифр трехзначного числа.

#*Пример:*

#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0) |
number = int(input("Введите трехзначное число: "))
if number >= 1000:
    print("Неверно! ВВедите трехзначное число: ")
else:
    a = int(number % 1000 / 100)
    b = int(number % 100 / 10)
    c= int(number % 10)
    summa = a + b + c
    print(summa)
    
    